IDENTIFICATION DIVISION.
PROGRAM-ID. PERFORMTEST.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 INDEX-VALUE      PIC 9(2) VALUE 1.
01 TOTAL-SUM        PIC 9(4) VALUE 0.

PROCEDURE DIVISION.
    PERFORM INIT-THRU-END

    DISPLAY "Final Sum: " TOTAL-SUM
    STOP RUN.

INIT-THRU-END.
    PERFORM VARYING INDEX-VALUE FROM 1 BY 1 UNTIL INDEX-VALUE > 5
        ADD INDEX-VALUE TO TOTAL-SUM
        DISPLAY "INDEX: " INDEX-VALUE " SUM: " TOTAL-SUM
    END-PERFORM
    GOBACK.
